<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<%@page import="util.web.CookieMgr"%>
<%
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■[[ 쿠키 매니저 메소드 메뉴얼 v1.3]]■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 인스턴스 ] 현재페이지가 주입받은 요청객체와 응답객체를 생성자로 넘기고, 기존에 생성된 쿠키를 Map에 담아둠.
	CookieMgr ckMgr = new CookieMgr(request, response);
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 확인하기1 - 이름으로 쿠키존재확인하기 ] : Boolean
	boolean isCookie = ckMgr.checkCookie("demoCookie");
//──────────────────────────────────────────────────────────────────────────────────────
//	[ 확인하기2 - 저장된 모든 쿠키를 콘솔창에 출력하기 ] : void
	ckMgr.checkCookie("demoCookie");
	//이클립스 콘솔창에서 확인하세요
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 생성1 - 쿠키 만들기 ] : void
	ckMgr.setCookie("demoCookie","한글도 상관없는 쿠키값");
//──────────────────────────────────────────────────────────────────────────────────────
//	[ 생성2 - 쿠키 만들기+시간 ] : void
	ckMgr.setCookie("demoCookie","한글도 상관없는 쿠키값",60*60);
//──────────────────────────────────────────────────────────────────────────────────────
//	[ 생성3 - 쿠키 만들기+시간+경로 ] : void
	ckMgr.setCookie("demoCookie","한글도 상관없는 쿠키값",60*60,"/");
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 읽기1 - 이름 ▶ 쿠키주소번지 ] : Cookie
	Cookie readCookie = ckMgr.getCookie("demoCookie");
//──────────────────────────────────────────────────────────────────────────────────────
//	[ 읽기2 - 값 ▶ 쿠키이름] : String 	**주의 :: 같은 값이 다수일 때 하나만 조회됨.
	String readName = ckMgr.getCookieNameFromValue("demoCookie");
//	 <권장>	[내장 객체|쿠키이름] : Stirng
			String readName2 = readCookie.getName();
//──────────────────────────────────────────────────────────────────────────────────────
//	[ 읽기3 - 값 ▶ 쿠키값] : String	
	String readValue = ckMgr.getCookieValue("demoCookie");
//	 <권장>	[내장 객체|쿠키값] : Stirng
			String readValue2 = readCookie.getValue();
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 변경 ] : int ( 변경 성공시 1 / 실패시 0 )
	int result_change = ckMgr.changeCookieValue("demoCookie", "바꿀때도 상관없는 한글");
	//조건문을 활용하면 유용할 것
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 삭제 ] : int ( 삭제 성공시 1 / 실패시 0 )
	int result_delete = ckMgr.deleteCookie("demoCookie");
	//조건문을 활용하면 유용할 것
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 시간1 - 유효시간 설정 ] : int ( 설정 성공시 1 / 실패시 0 )
	int result_setAge = ckMgr.setCookieAge("demoCookie", 60*60);
	//조건문을 활용하면 유용할 것
//──────────────────────────────────────────────────────────────────────────────────────
//	[ 시간2 - 유효시간 알아내기 ] : int (유효시간-초)
	int readCookieAge = ckMgr.getCookieAge("demoCookie");
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
//	[ 경로1 - 경로 설정하기 ] : int ( 설정 성공시 1 / 실패시 0 )
	int result_setPaht = ckMgr.setCookiePath("demoCookie", "/");
	//조건문을 활용하면 유용할 것
//──────────────────────────────────────────────────────────────────────────────────────
//	[ 쿠키2 - 경로 알아내기 ] : String
	String result_path = ckMgr.getCookiePath("demoCookie");
//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
%>