<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=EUC-KR">
<title>Insert title here</title>
<!-- ―――[[ import ]]―――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――― -->
	<!-- [경로확인 필수!!] 깊이 넣어놨으면 꼭 ../로 한번더 꺼내주세요~! -->
	<script type="text/javascript" src="/js/jquery-1.12.0.js"></script>
</head>
<!--
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
-->
<body>
<!-- ―――[[BODY script]]――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――― -->
<script type="text/javascript">
	//자바스크립트는 싱글과 더블쿼테이션으로 '값'으로 인식하고, 없으면 '변수'로 인식한다.
	//자바스크립트는 싱글과 더블쿼테이션을 구분하지 않는다.(다만 같이 사용할 때는 더블이 밖, 싱글이 안)
	var s = "English";
	//자바스크립트 변수에 자바코드의 값을 담을 수 있다.
	//단, 정적인 값만 담긴다. 즉, 동적으로 변하는 값은 담을 수 없다.
	s = "<% out.print("한글");%>";
	alert("s에 담긴 값 : "+s);
	
	<%
		String general = "이순신";
		/* out.print(s); */
		out.print(general);
	%>
	
	alert("한글 창시자 : "
		+"<%
			String king = "세종대왕";
			out.print(king);
		  %>");

	//서버(톰켓)에서 자바스크립트코드보다 자바코드가 먼저 실행된다.
	//그 실행결과물의 마임타입은 html이고,
	//로컬PC에 된 다운로드된 뒤에 브라우저에서 실행된다. 
	//다운로드 : 버퍼캐시메모리에 적재된다 - get방식
	//		    다운로드된 결과물이 서버로 가지못하고 브라우저가 인터셉터함
	
	//그렇다면 브라우저는 어떻게 그 사람의 요청을 알고 인터셉트하는가?
	//브라우저마다 서버는 세션아이디를 상수값으로 부여한다.
	//세션(서버:캐시메모리)아이디는 쿠키(로컬PC)에 text로 저정됨
	
	//새로운 브라우저를 열면 세션아이디가 바뀌게 되는데, 이러한 방식이 너무 귀찮다.
	//기존 브라우저의 get방식(URL주소로 요청)일때 URL에 ?1등을 추가하면
	//브라우저가 새로운 요청으로 인식함 
	/*
		총정리
		1. 자바스크립트 변수에 자바값을 담을 수 있다
			그러나, 자바의 값에 자바스크립트의 값을 담을 수 없다. (컴파일 순서때문)
		2. 주의할 점은 자바코드에 의한 변수의 값은 이미 서버에서 결정된 값이므로
			(자바코드의 컴파일을 먼저 진행하기 때문에) 브라우저가 취급하는 소스코드에
			컴파일된 결과값만 전달되고 자바스크립트 코드는 그 결과값과 함께 화면에 출력함
	*/
</script>
<!-- ―――[[BODY content]]――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――― -->
	Document.write(s);<br><!-- 단순한 HTML문서이기 때문에 저대로 출력됨 -->

</body>
</html>